Repository: u71536/playlistchecker
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru

# login.invalid_username_or_password
source: Invalid username or password
ru: Неверное имя пользователя или пароль

# flash.user_exists_username
source: User with this username already exists
ru: Пользователь с таким именем уже существует

# flash.user_exists_email
source: User with this email already exists
ru: Пользователь с таким email уже существует

# flash.registration_success
source: Registration successful! You can now log in.
ru: Регистрация успешна! Теперь вы можете войти в систему.

# flash.playlist_added_success
source: Playlist "{playlist_name}" successfully added for monitoring!
ru: Плейлист "{playlist_name}" успешно добавлен для мониторинга!

# flash.error_generic
source: Error: {error}
ru: Ошибка: {error}

# flash.error_adding_playlist
source: Error adding playlist: {error}
ru: Произошла ошибка при добавлении плейлиста: {error}

# flash.connect_spotify_first
source: Please connect Spotify first
ru: Сначала подключите Spotify

# flash.spotify_token_updated
source: Spotify token updated automatically
ru: Токен Spotify обновлен автоматически

# flash.error_getting_playlists_after_token_update
source: Error getting playlists after token update: {error}
ru: Ошибка получения плейлистов после обновления токена: {error}

# flash.error_getting_playlists
source: Error getting playlists: {error}
ru: Ошибка получения плейлистов: {error}

# flash.error_generic_short
source: An error occurred: {error}
ru: Произошла ошибка: {error}

# flash.playlists_checked
source: Playlists checked! Check notifications.
ru: Плейлисты проверены! Проверьте уведомления.

# flash.error_checking_playlists
source: Error checking playlists: {error}
ru: Ошибка при проверке плейлистов: {error}

# flash.playlist_not_found
source: Playlist not found
ru: Плейлист не найден

# flash.spotify_auth_error_no_code
source: Spotify authorization error: code not received
ru: Ошибка авторизации Spotify: код не получен

# flash.spotify_connected_success
source: Spotify successfully connected!
ru: Spotify успешно подключен!

# flash.spotify_auth_error
source: Spotify authorization error: {error}
ru: Ошибка авторизации Spotify: {error}

# flash.deezer_auth_coming_soon
source: Deezer authorization will be implemented
ru: Авторизация Deezer будет реализована

# flash.apple_music_auth_coming_soon
source: Apple Music authorization will be implemented soon
ru: Авторизация Apple Music будет реализована в скором времени

# flash.yandex_music_auth_coming_soon
source: Yandex Music authorization will be implemented soon
ru: Авторизация Yandex Music будет реализована в скором времени

# flash.notification_settings_saved
source: Notification settings saved!
ru: Настройки уведомлений сохранены!

# service.apple_music.credentials_not_configured
source: Apple Music credentials not configured
ru: Не настроены учетные данные Apple Music

# service.apple_music.developer_token_error
source: Error creating developer token: {error}
ru: Ошибка создания developer token: {error}

# service.apple_music.invalid_playlist_url
source: Invalid Apple Music playlist URL
ru: Неверный URL плейлиста Apple Music

# service.apple_music.playlist_info_error
source: Error getting playlist information: {status_code}
ru: Ошибка получения информации о плейлисте: {status_code}

# service.deezer.access_token_error
source: Error getting Deezer access token
ru: Ошибка получения токена доступа Deezer

# service.deezer.invalid_playlist_url
source: Invalid Deezer playlist URL
ru: Неверный URL плейлиста Deezer

# service.deezer.playlist_info_error
source: Error getting playlist information: {status_code}
ru: Ошибка получения информации о плейлисте: {status_code}

# service.deezer.playlist_tracks_error
source: Error getting playlist tracks: {error}
ru: Ошибка получения треков плейлиста: {error}

# service.spotify.invalid_playlist_url
source: Invalid Spotify playlist URL
ru: Неверный URL плейлиста Spotify

# service.spotify.token_refresh_error
source: Error refreshing token: {error}
ru: Ошибка обновления токена: {error}

# service.spotify.playlist_info_error
source: Error getting playlist information: {error}
ru: Ошибка получения информации о плейлисте: {error}

# service.spotify.playlist_tracks_error
source: Error getting playlist tracks: {error}
ru: Ошибка получения треков плейлиста: {error}

# service.spotify.user_playlists_error
source: Error getting user playlists: {error}
ru: Ошибка получения плейлистов пользователя: {error}

# service.spotify.token_expired_no_refresh
source: Token expired and no refresh_token available for renewal
ru: Токен истек и нет refresh_token для обновления

# service.spotify.token_invalid_no_refresh
source: Token is invalid and no refresh_token available for renewal
ru: Токен недействителен и нет refresh_token для обновления

# service.yandex_music.invalid_playlist_url
source: Invalid Yandex Music playlist URL
ru: Неверный URL плейлиста Yandex Music

# service.yandex_music.api_error
source: API error: {status_code} - {response_text}
ru: Ошибка API: {status_code} - {response_text}

# service.yandex_music.playlist_info_error
source: Error getting public playlist information: {error}
ru: Ошибка получения информации о публичном плейлисте: {error}

# service.yandex_music.playlist_tracks_error
source: Error getting public playlist tracks: {error}
ru: Ошибка получения треков публичного плейлиста: {error}

# base.about
source: About
ru: О сервисе

# page.about.monitoring_description
source: Monitoring playlists on Spotify, Deezer, Apple Music, Yandex Music
ru: Мониторинг плейлистов Spotify, Deezer, Apple Music, Yandex Music

# page.about.keywords
source: about, playlistchecker, playlist monitoring, features, capabilities, spotify, deezer, apple music, yandex music, music services
ru: о сервисе, playlistchecker, мониторинг плейлистов, функции, возможности, spotify, deezer, apple music, yandex music, музыкальные сервисы

# page.about.subtitle
source: Professional solution for monitoring your music collections
ru: Профессиональное решение для мониторинга ваших музыкальных коллекций

# page.about.title
source: What is PlaylistChecker?
ru: Что такое PlaylistChecker?

# page.about.description
source: PlaylistChecker is an innovative web service created to solve the problem of disappearing songs from music playlists. We understand how important it is to preserve the integrity of your music collections, and offer an automated solution for monitoring changes.
ru: PlaylistChecker — это инновационный веб-сервис, созданный для решения проблемы исчезающих песен из музыкальных плейлистов. Мы понимаем, как важно сохранить целостность ваших музыкальных коллекций, и предлагаем автоматизированное решение для мониторинга изменений.

# page.about.work
source: Our service works 24/7, tracking your playlists on popular music platforms and notifying you of any changes in real time. No more need to manually check each playlist - we'll do it for you!
ru: Наш сервис работает 24/7, отслеживая ваши плейлисты на популярных музыкальных платформах и уведомляя вас о любых изменениях в режиме реального времени. Больше не нужно вручную проверять каждый плейлист — мы сделаем это за вас!

# why_check.stats_title
source: Problem statistics
ru: Статистика проблемы

# why_check.stats.users_lose_songs
source: Users are losing songs
ru: Пользователей теряют песни

# why_check.stats.due_to_licensing
source: due to licensing issues
ru: из-за лицензионных проблем

# why_check.stats.playlists_compromised
source: Playlists compromised
ru: Плейлистов нарушены

# why_check.stats.due_to_catalog_changes
source: due to catalog changes
ru: из-за изменений в каталогах

# why_check.stats.weeks_average
source: Average weeks
ru: Недели в среднем

# why_check.stats.until_detection
source: before changes are detected
ru: до обнаружения изменений

# why_check.stats.can_prevent
source: Can be prevented
ru: Можно предотвратить

# why_check.stats.with_monitoring
source: with monitoring
ru: с помощью мониторинга

# why_check.reasons_title
source: Why Do Songs Disappear?
ru: Почему песни исчезают из плейлистов?

# why_check.reason.license_expiration
source: License Expiration
ru: Истечение лицензий

# why_check.reason.license_expiration_desc
source: Music labels and artists may not renew licensing agreements with streaming services, leading to track removal from catalogs.
ru: Музыкальные лейблы и исполнители могут не продлить лицензионные соглашения со стриминговыми сервисами, что приводит к удалению треков из каталогов.

# why_check.reason.copyright_disputes
source: Copyright Disputes
ru: Споры об авторских правах

# why_check.reason.copyright_disputes_desc
source: Conflicts between rights holders can lead to temporary or permanent content removal from all services.
ru: Конфликты между правообладателями могут привести к временному или постоянному удалению контента из всех сервисов.

# why_check.reason.regional_restrictions
source: Regional Restrictions
ru: Региональные ограничения

# why_check.reason.regional_restrictions_desc
source: Changes in geo-blocking can make previously available tracks unavailable in your region.
ru: Изменения в геоблокировке могут сделать ранее доступные треки недоступными в вашем регионе.

# why_check.reason.technical_failures
source: Technical Failures
ru: Технические сбои

# why_check.reason.technical_failures_desc
source: Errors in music service systems can lead to temporary content unavailability.
ru: Ошибки в системах музыкальных сервисов могут привести к временной недоступности контента.

# why_check.reason.metadata_changes
source: Metadata Changes
ru: Изменения метаданных

# why_check.reason.metadata_changes_desc
source: Track information updates can change their identifiers, leading to "disappearance" from playlists.
ru: Обновления информации о треках могут изменить их идентификаторы, что приведет к "исчезновению" из плейлистов.

# why_check.reason.platform_policy
source: Platform Policy
ru: Политика платформ

# why_check.reason.platform_policy_desc
source: Changes in service rules can lead to removal of certain content for various reasons.
ru: Изменения в правилах сервисов могут привести к удалению определенного контента по различным причинам.

# why_check.consequences_title
source: Consequences for Users
ru: Последствия для пользователей

# why_check.consequences.emotional_title
source: Emotional Losses
ru: Эмоциональные потери

# page.about.problem.consequence1
source: Loss of favorite tracks
ru: Потеря любимых композиций

# page.about.problem.consequence2
source: Disruption of playlist integrity
ru: Нарушение целостности плейлистов

# page.about.problem.consequence3
source: Need for manual checking
ru: Необходимость ручной проверки

# page.about.problem.consequence4
source: Time lost on restoration
ru: Потеря времени на восстановление

# why_check.consequences.practical_title
source: Practical Problems
ru: Практические проблемы

# page.about.problem.consequence5
source: Synchronization problems
ru: Последствия для пользователей

# why_check.solutions_title
source: How PlaylistChecker Solves These Problems
ru: Как PlaylistChecker решает эти проблемы

# why_check.solution.constant_monitoring
source: Constant Monitoring
ru: Постоянное наблюдение

# why_check.solution.constant_monitoring_desc
source: Our service works 24/7, tracking every change in your playlists
ru: Наш сервис работает 24/7, отслеживая каждое изменение в ваших плейлистах

# why_check.solution.instant_notifications
source: Instant Notifications
ru: Мгновенные уведомления

# why_check.solution.instant_notifications_desc
source: Get notifications about any changes within 10 minutes of their occurrence
ru: Получайте уведомления о любых изменениях в течение 10 минут после их возникновения

# why_check.solution.detailed_analytics
source: Detailed Analytics
ru: Детальная аналитика

# why_check.solution.detailed_analytics_desc
source: Complete change history and statistics to understand trends in your collections
ru: Полная история изменений и статистика для понимания трендов в ваших коллекциях

# page.about.features.title
source: PlaylistChecker Features
ru: Возможности PlaylistChecker

# page.about.features.monitoring
source: Automatic monitoring
ru: Автоматический мониторинг

# page.about.features.monitoring.description
source: Constant checking of your playlists once a day without your participation
ru: Постоянная проверка ваших плейлистов раз в день без вашего участия

# page.about.features.notifications
source: Instant notifications
ru: Мгновенные уведомления

# page.about.features.notifications.description
source: Receive notifications about any changes in your playlists in real time
ru: Получайте уведомления о любых изменениях в ваших плейлистах в реальном времени

# page.about.features.platforms
source: Multiple platforms
ru: Множество платформ

# page.about.features.platforms.description
source: Support for Spotify, Apple Music, Yandex Music and other popular services
ru: Поддержка Spotify, Apple Music, Yandex Music и других популярных сервисов

# page.about.features.stats
source: Detailed statistics
ru: Детальная статистика

# page.about.features.stats.description
source: Analysis of changes, modification history and trends in your collections
ru: Анализ изменений, история модификаций и тренды в ваших коллекциях

# page.about.features.security
source: Data security
ru: Безопасность данных

# page.about.features.security.description
source: Your data is protected by modern encryption and authentication methods
ru: Ваши данные защищены современными методами шифрования и аутентификации

# page.about.features.interface
source: User-friendly interface
ru: Удобный интерфейс

# page.about.features.interface.description
source: Adaptive design for comfortable use on any device
ru: Адаптивный дизайн для комфортного использования на любых устройствах

# why_check.benefits_title
source: Benefits of Playlist Monitoring
ru: Преимущества мониторинга плейлистов

# why_check.benefit.preserve_integrity
source: Preserving Collection Integrity
ru: Сохранение целостности коллекций

# why_check.benefit.preserve_integrity_desc
source: You will always know about any changes in your playlists and can quickly take action to restore them.
ru: Вы всегда будете знать о любых изменениях в ваших плейлистах и сможете быстро принять меры для их восстановления.

# why_check.benefit.save_time
source: Time Saving
ru: Экономия времени

# why_check.benefit.save_time_desc
source: No more need to manually check each playlist - our service will do it automatically and notify you only about important changes.
ru: Больше не нужно вручную проверять каждый плейлист — наш сервис сделает это автоматически и уведомит вас только о важных изменениях.

# why_check.benefit.protect_memories
source: Protecting Musical Memories
ru: Защита музыкальных воспоминаний

# why_check.benefit.protect_memories_desc
source: Your favorite songs and playlists are not just music, they are memories. We will help preserve them.
ru: Ваши любимые песни и плейлисты — это не просто музыка, это воспоминания. Мы поможем их сохранить.

# why_check.benefit.understand_trends
source: Understanding Trends
ru: Понимание трендов

# why_check.benefit.understand_trends_desc
source: Analyze which artists or genres disappear most often from catalogs and plan your collections accordingly.
ru: Анализируйте, какие исполнители или жанры чаще всего исчезают из каталогов, и планируйте свои коллекции соответственно.

# page.about.features.supported.title
source: Supported music services
ru: Поддерживаемые музыкальные сервисы

# page.about.features.supported.spotify.description
source: Full support for all Spotify features, including public and private playlists
ru: Полная поддержка всех функций Spotify, включая публичные и приватные плейлисты

# page.about.features.supported.apple_music.description
source: Apple Music playlist monitoring with preservation of all metadata
ru: Мониторинг плейлистов Apple Music с сохранением всех метаданных

# page.about.features.supported.yandex_music.description
source: Tracking changes in Yandex Music playlists
ru: Отслеживание изменений в плейлистах Яндекс.Музыки

# why_check.cta_title
source: Don't wait for your songs to disappear!
ru: Не ждите, пока ваши песни исчезнут!

# why_check.cta_description
source: Start protecting your music collections today. PlaylistChecker will help you preserve what matters.
ru: Начните защищать свои музыкальные коллекции уже сегодня. PlaylistChecker поможет вам сохранить то, что важно.

# why_check.cta.start_monitoring
source: Start Monitoring
ru: Начать мониторинг

# base.login
source: Login
ru: Войти

# why_check.cta.my_playlists
source: My Playlists
ru: Мои плейлисты

# add_playlist.add_playlist
source: Add a playlist
ru: Добавить плейлист

# add_playlist.paste_playlist_url
source: Paste the playlist link
ru: Вставьте ссылку на плейлист

# add_playlist.copy_playlist_url
source: Copy the playlist link from your music service
ru: Скопируйте ссылку на плейлист из вашего музыкального сервиса

# add_playlist.how_to_add_playlist
source: How to add a playlist?
ru: Как добавить плейлист?

# add_playlist.open_spotify
source: Open Spotify (web or app)
ru: Откройте Spotify (веб-версия или приложение)

# add_playlist.find_playlist
source: Find the playlist you want
ru: Найдите нужный плейлист

# add_playlist.click_three_dots
source: Click the three dots (...) next to the playlist name
ru: Нажмите на три точки (...) рядом с названием плейлиста

# add_playlist.select_share_copy_link
source: Select Share → Copy Playlist Lin
ru: Выберите "Поделиться" → "Скопировать ссылку на плейлист"

# add_playlist.paste_link_field
source: Paste the link in the field above
ru: Вставьте ссылку в поле выше

# add_playlist.open_apple_music
source: Open Apple Music
ru: Откройте Apple Music

# add_playlist.select_share_playlist
source: Select "Share Playlist\
ru: Выберите "Поделиться плейлистом"

# add_playlist.copy_link
source: Copy the link
ru: Скопируйте ссылку

# add_playlist.important
source: Important:
ru: Важно:

# add_playlist.yandex_music_public
source: To monitor Yandex.Music playlists, they must be public!
ru: Для мониторинга плейлистов Яндекс.Музыки они должны быть публичными!

# add_playlist.open_yandex_music
source: Open Yandex.Music in the browser
ru: Откройте Яндекс.Музыку в браузере

# add_playlist.check_public_playlist
source: Make sure the playlist is public (accessible via link)
ru: Убедитесь, что плейлист публичный (доступен по ссылке)

# add_playlist.copy_link_from_browser
source: Copy the link from the browser's address bar
ru: Скопируйте ссылку из адресной строки браузера

# add_playlist.example_link
source: Example link:
ru: Пример ссылки:

# seo.default_title
source: PlaylistChecker - Monitor Spotify, Apple Music, Yandex Music Playlists
ru: PlaylistChecker - Мониторинг плейлистов Spotify, Apple Music, Yandex Music

# seo.default_description
source: PlaylistChecker - professional service for monitoring playlists. Track songs disappearing from your Spotify, Apple Music, and Yandex Music playlists. Receive notifications about any changes in real time.
ru: PlaylistChecker - профессиональный сервис для мониторинга плейлистов. Отслеживайте исчезновение песен из ваших плейлистов Spotify, Apple Music и Yandex Music. Получайте уведомления о любых изменениях в режиме реального времени.

# seo.default_keywords
source: playlist, music, spotify, apple music, yandex music, tracking, monitoring, songs, tracks, disappearance, notifications, music services, playlist monitoring, track changes
ru: плейлист, музыка, spotify, apple music, yandex music, отслеживание, мониторинг, песни, треки, исчезновение, уведомления, музыкальные сервисы, мониторинг плейлистов, отслеживание изменений

# base.home
source: Home
ru: Главная

# base.my_playlists
source: My playlists
ru: Мои плейлисты

# base.notification_settings
source: Notifications settings
ru: Настройка уведомлений

# base.notification_history
source: Notifications history
ru: История уведомлений

# base.logout
source: Logout
ru: Выйти

# base.register
source: Register
ru: Регистрация

# footer.message
source: Terms of Service
ru: Сервис для мониторинга изменений в ваших плейлистах в Spotify, Yandex Music и Apple Music"

source: links
ru: Ссылки

# base.follow_changes
source: Why Check
ru: Отслеживайте что поменялось в ваших плейлистах

# dashboard.dashboard
source: Dashboard
ru: Панель управления

# dashboard.new_notification
source: New Notifications
ru: Новые уведомления

# dashboard.playlists_being_tracked
source: Playlists being tracked
ru: Плейлистов отслеживается

# dashboard.checked_today
source: Checked today
ru: Проверено сегодня

# dashboard.new_notifications
source: New Notifications
ru: Новых уведомлений

# dashboard.next_check
source: Next Check
ru: Следующая проверка

# dashboard.connected_services
source: Connected Services
ru: Подключенные сервисы

# dashboard.connected
source: Connected
ru: Подключен

# notification_settings.connect_telegram
source: Connect
ru: Подключить

# dashboard.public_playlists
source: Public Playlists
ru: Публичные плейлисты

# dashboard.without_authorization
source: Without authorization
ru: Без авторизации

# dashboard.not_checked
source: Not checked
ru: Не проверялся

# dashboard.no_playlists
source: You don't have any playlists yet.
ru: У вас пока нет плейлистов

# dashboard.add_playlists_for_tracking
source: Add playlists for tracking changes.
ru: Добавьте плейлисты для отслеживания изменений

# add_playlist.add_new_playlist
source: Add first playlist
ru: Добавить первый плейлист

# page.home.monitoring_description
source: Monitoring playlists on Spotify, Deezer, Apple Music, Yandex Music
ru: Отслеживание изменений в плейлистах Spotify, Deezer, Apple Music, Yandex Music

# page.home.description
source: songs disappearing from your Spotify, Deezer, Apple Music, and Yandex playlists. Music. Receive notifications about any changes in real time.
ru: профессиональный сервис для мониторинга плейлистов. Отслеживайте исчезновение песен из ваших плейлистов Spotify, Deezer, Apple Music и Yandex Music. Получайте уведомления о любых изменениях в режиме реального времени.

# page.home.keywords
source: playlist, music, spotify, deezer, apple music, yandex music, tracking,monitoring, songs, tracks, disappearance, notifications, music services
ru: плейлист, музыка, spotify, deezer, apple music, yandex music, отслеживание, мониторинг, песни, треки, исчезновение, уведомления, музыкальные сервисы

# page.home.subtitle
source: Professional solution for monitoring your music collections
ru: Отслеживайте изменения в ваших плейлистах на всех популярных музыкальных платформах

# action.register
source: Register
ru: Зарегистрироваться

# action.login
source: Login
ru: Войти

# form.username
source: Username
ru: Имя пользователя

# action.login.description
source: Automatic daily checking of all your playlists
ru: Авторизуйтесь

# form.register
source: Register
ru: Регистрация

# action.register_description
source: Deezer support will be available soon
ru: Создайте новый аккаунт

# page.home.supported_services
source: Supported music services
ru: Поддерживаемые сервисы

# page.home.spotify_description
source: Full support for all playlist types, including collaborative ones
ru: Мониторинг плейлистов Spotify

# page.home.deezer_description
source: Monitoring Deezer playlists
ru: Мониторинг плейлистов Deezer

# page.home.apple_music_description
source: Monitoring personal and public Apple Music playlists
ru: Мониторинг плейлистов Apple Music

# page.home.yandex_music_description
source: Tracking changes in Yandex Music playlists
ru: Мониторинг плейлистов Yandex Music

# page.home.how_it_works
source: How It Works
ru: Как это работает

# page.home.step1.title
source: What is PlaylistChecker?
ru: Подключите сервисы
