Repository: u71536/playlistchecker
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru

# page.home.step1.description
source: PlaylistChecker is an innovative web service created to solve the problem of disappearing songs from music playlists. We understand how important it is to preserve the integrity of your music collections, and offer an automated solution for monitoring changes.
ru: Авторизуйтесь в ваших музыкальных сервисах

# page.home.step2.title
source: What is PlaylistChecker?
ru: Добавьте плейлисты

# page.home.step2.description
source: PlaylistChecker is an innovative web service created to solve the problem of disappearing songs from music playlists. We understand how important it is to preserve the integrity of your music collections, and offer an automated solution for monitoring changes.
ru: Выберите плейлисты для мониторинга

# page.home.step3.title
source: What is PlaylistChecker?
ru: Получайте уведомления

# page.home.step3.description
source: PlaylistChecker is an innovative web service created to solve the problem of disappearing songs from music playlists. We understand how important it is to preserve the integrity of your music collections, and offer an automated solution for monitoring changes.
ru: Мы уведомим вас о любых изменениях

# page.home.features.title
source: PlaylistChecker Features
ru: Возможности PlaylistChecker

# page.home.feature.sync.title
source: PlaylistChecker Features
ru: Автоматическая синхронизация

# page.home.feature.sync.description
source: Analysis of changes, modification history and trends in your collections
ru: Постоянный мониторинг всех ваших плейлистов

# page.home.feature.stats.title
source: PlaylistChecker Features
ru: Детальная статистика

# page.home.feature.stats.description
source: Analysis of changes, modification history and trends in your collections
ru: Анализ изменений и трендов в ваших коллекциях

# page.home.feature.security.title
source: Data security
ru: Безопасность данных

# page.home.feature.security.description
source: Your data is protected by modern encryption and authentication methods
ru: Ваши данные защищены современными методами шифрования

# page.home.problem.title
source: Why do songs disappear?
ru: Проблема исчезающих песен

# page.home.problem.description
source: PlaylistChecker is an innovative web service created to solve the problem of disappearing songs from music playlists. We understand how important it is to preserve the integrity of your music collections, and offer an automated solution for monitoring changes.
ru: Музыкальные сервисы регулярно удаляют треки из своих каталогов из-за истечения лицензий, проблем с авторскими правами или изменений в политике платформы. Ваши любимые песни могут исчезнуть без предупреждения.

# page.home.protection.title
source: Why do songs disappear?
ru: Защита ваших коллекций

# page.home.protection.description
source: PlaylistChecker is an innovative web service created to solve the problem of disappearing songs from music playlists. We understand how important it is to preserve the integrity of your music collections, and offer an automated solution for monitoring changes.
ru: PlaylistChecker помогает сохранить целостность ваших музыкальных коллекций, уведомляя о любых изменениях в режиме реального времени. Вы всегда будете знать, что происходит с вашими плейлистами.

# page.home.monitoring.title
source: Automatic monitoring
ru: Автоматический мониторинг

# page.home.monitoring.description
source: Constant checking of your playlists once a day without your participation
ru: Наш сервис проверяет ваши плейлисты каждые 10 минут, обеспечивая максимально быстрое обнаружение изменений. Больше не нужно вручную проверять каждый плейлист.

# page.home.notifications.title
source: Notification Settings
ru: Удобные уведомления

# page.home.notifications.description
source: Receive notifications about any changes in your playlists in real time
ru: Получайте мгновенные уведомления о любых изменениях в ваших плейлистах. Узнайте, какие песни исчезли, и примите меры для восстановления вашей коллекции.

# seo.login.description
source: Login to PlaylistChecker to monitor your Spotify, Apple Music, and Yandex Music playlists. Track changes in your music collections.
ru: Войдите в PlaylistChecker для мониторинга ваших плейлистов Spotify, Apple Music и Yandex Music. Отслеживайте изменения в ваших музыкальных коллекциях.

# seo.login.keywords
source: login, sign in, authentication, playlistchecker, playlist monitoring, spotify, apple music, yandex music
ru: войти, вход, авторизация, playlistchecker, мониторинг плейлистов, spotify, apple music, yandex music

# login.title
source: Sign in
ru: Вход

# login.no_account
source: Don't have an account?
ru: Нет аккаунта?

# login.register
source: Register
ru: Зарегистрироваться

source: notification_history.date_time
ru: Дата и время

source: notification_history.playlist
ru: Плейлист

source: notification_history.change_type
ru: Тип изменения

source: notification_history.track
ru: Трек

source: notification_history.send_method
ru: Способ отправки

source: notification_history.track_added
ru: Добавлен трек

source: notification_history.track_removed
ru: Удален трек

source: notification_history.change
ru: Изменение

source: notification_history.information_unavailable
ru: Информация недоступна

source: notification_history.browser
ru: Браузер

source: notification_history.previous
ru: Предыдущая

# notification_history.next
source: Next
ru: Следующая

# notification_history.shown
source: Shown
ru: Показано

# notification_history.from
source: from
ru: из

# notification_history.notifications
source: notifications
ru: уведомлений

# notification_history.notifications_only_once
source: Notifications are sent only once for each change in the playlist.
ru: Уведомления отправляются только один раз для каждого изменения в плейлисте.

# notification_history.empty
source: Notification history is empty.
ru: История уведомлений пуста

# notification_history.empty_description
source: You haven't received any notifications yet. Add playlists to start monitoring changes.
ru: История уведомлений пуста

# notification_history.go_to_playlists
source: Go to playlists
ru: Перейти к плейлистам"

# notification_settings.title
source: Notification Settings
ru: Настройки уведомлений

# notification_settings.manage_notifications
source: Manage Notifications
ru: Управление уведомлениями

# notification_settings.email_notifications
source: Email Notifications
ru: Email уведомления

# notification_settings.receive_email_notifications
source: Receive Email Notifications
ru: Получать уведомления на email

# notification_settings.notifications_will_be_sent_to
source: Notifications will be sent to
ru: Уведомления будут отправляться на

# notification_settings.telegram_notifications
source: Telegram notifications
ru: Telegram уведомления

# notification_settings.receive_telegram_notifications
source: Receive notifications in Telegram
ru: Получать уведомления в Telegram

# notification_settings.telegram_connected
source: Telegram is connected
ru: Telegram подключен

# notification_settings.telegram_not_connected
source: Telegram is not connected
ru: Telegram не подключен

# notification_settings.browser_notifications
source: Browser Notifications
ru: Браузерные уведомления

# notification_settings.receive_browser_notifications
source: Receive push notifications in the browser
ru: Получать push-уведомления в браузере

# notification_settings.allow_notifications
source: Allow notifications
ru: Разрешить уведомления

# notification_settings.notification_types
source: Notification types:
ru: Типы уведомлений:

# notification_settings.track_removed
source: Removing tracks from playlists
ru: Удаление треков из плейлистов

# notification_settings.track_added
source: Adding new tracks
ru: Добавление новых треков

# notification_settings.playlist_changes
source: Changes in playlists
ru: Изменения в плейлистах

# notification_settings.check_frequency
source: Check frequency:
ru: Частота проверки:

# notification_settings.every_10_minutes
source: Every day
ru: Каждые день

# notification_settings.privacy
source: Privacy:
ru: Конфиденциальность:

# notification_settings.we_do_not_share_your_data
source: We do not share your data with third parties. Notifications are sent only toyou.
ru: Мы не передаем ваши данные третьим лицам. Уведомления отправляются только вам.

# notification_settings.browser_does_not_support_push_notifications
source: Your browser does not support push notifications.
ru: Ваш браузер не поддерживает push-уведомления

# notification_settings.push_notifications_are_allowed
source: Push notifications are allowed.
ru: Push-уведомления разрешены

# notification_settings.click_button_to_allow_push_notifications
source: Click the button below to allow push notifications
ru: Нажмите кнопку ниже, чтобы разрешить push-уведомления

# playlist_tracks.tracks
source: Tracks
ru: Треки

# playlist_tracks.back_to_playlists
source: Back to Playlists
ru: Назад к плейлистам

# playlist_tracks.total_tracks
source: Total Tracks
ru: Всего треков

# playlist_tracks.active_tracks
source: Active
ru: Активных

# playlist_tracks.removed_tracks
source: Removed
ru: Удалено

# playlist_tracks.last_check
source: Last Check
ru: Последняя проверка

# playlist_tracks.all_tracks
source: All Tracks
ru: Все треки

# playlist_tracks.artist
source: Artist
ru: Исполнитель

# playlist_tracks.album
source: Album
ru: Альбом

source: playlist_tracks.duration
ru: Длительность

source: playlist_tracks.status
ru: Статус

source: playlist_tracks.added_at
ru: Добавлен

source: playlist_tracks.removed
ru: Удален

source: playlist_tracks.active
ru: Активен

source: playlist_tracks.tracks_not_found
ru: Треки не найдены

# playlist_tracks.no_tracks_in_playlist
source: There are no tracks in this playlist yet.
ru: В этом плейлисте пока нет треков

# seo.register.description
source: Register for PlaylistChecker - professional service for monitoring playlists. Start tracking changes in your music collections today.
ru: Зарегистрируйтесь в PlaylistChecker - профессиональном сервисе для мониторинга плейлистов. Начните отслеживать изменения в ваших музыкальных коллекциях уже сегодня.

# seo.register.keywords
source: register, create account, playlistchecker, playlist monitoring, spotify, apple music, yandex music, track changes
ru: регистрация, создать аккаунт, playlistchecker, мониторинг плейлистов, spotify, apple music, yandex music, отслеживание изменений

# spotify_playlists.title
source: My Spotify Playlists
ru: Мои плейлисты Spotify

# spotify_playlists.subtitle
source: Select playlists to start monitoring
ru: Выберите плейлисты для начала мониторинга

# spotify_playlists.add_manually
source: Add Manually
ru: Добавить вручную

# spotify_playlists.public
source: Public
ru: Публичный

# spotify_playlists.private
source: Private
ru: Приватный

# spotify_playlists.tracks
source: Tracks
ru: Треков

# spotify_playlists.owner
source: Owner
ru: Владелец

# spotify_playlists.add_for_monitoring
source: Add for Monitoring
ru: Добавить для мониторинга

# spotify_playlists.open_in_spotify
source: Open in Spotify
ru: Открыть в Spotify

# spotify_playlists.how_it_works
source: How It Works
ru: Как это работает

# spotify_playlists.how_it_works_description
source: Select the playlists you want to track. We'll check them daily and notify you if any tracks are removed or if changes are detected.
ru: Выберите плейлисты, которые хотите отслеживать. Мы будем проверять их ежедневно и уведомлять вас, если какие-либо треки будут удалены или будут обнаружены изменения.

# spotify_playlists.no_playlists_found
source: No Playlists Found
ru: Плейлисты не найдены

# spotify_playlists.no_playlists_description
source: You don't have any playlists in Spotify yet, or there was an error fetching them.
ru: У вас пока нет плейлистов в Spotify, или произошла ошибка при их получении.

# spotify_playlists.add_playlist_manually
source: Add Playlist Manually
ru: Добавить плейлист вручную
